// MyLab1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//



#include <iostream>
#include <math.h>
using namespace std;

int main()
{
    double x, y, z, a, b, c, d, s;

    cout << "vvedite x: ";
    cin >> x;
    cout << "vvedite y: ";
    cin >> y;
    cout << "vvedite z: ";
    cin >> z;

    a = 1 + pow(sin(x + y), 2);
    b = fabs(x - (2 * y) / (1 + pow(x, 2) * pow(y, 2)));
    c = pow(x, fabs(y));
    d = pow((cos(atan(1 / z))), 2);
    s = (a / b) * c + d;

    cout << "Result s = " << s << endl;
    return 0;
}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
